```c#
//Что выведет на экран следующий код?
int x = 5;
if (x < 6 && ++x <6)
{
    x++;
}
else
{
    --x;
}
Console.WriteLine(--x);

```

```c#
//Что выведет на экран консоли следующий код?

sbyte x = 126;

checked
{
  ++x;
  unchecked
  {
    x++;
  }
}

Console.WriteLine(x);
```

```c#
//Каким будет результат выполнения данного участка кода?

byte[,,,] array =

{

    {

        {

            { 0, 1, 2 },

            { 2, 3, 4 },

            { 5, 6, 7 }

        },

        {

            { 8, 9, 10 },

            { 11, 12, 13 },

            { 14, 15, 16 }

        }

    }

};

Console.WriteLine(array[0, 0, 2, 2]);
```

```c#
// Какой результат мы получим в результате выполнения данного кода?



static void Main() {Method(2);}
static void Method ( int x = 1, int y = 2, int z = 3)
{
    Method (2);
    Console.WriteLine(x);
}

```

```c#
//Что пользователь увидит на экране в результате работы выражений?

int x = 7;

Console.WriteLine("{0} + {1}", 5>6 && 6<++x, x);
```
```c#
Что выведет на экран следующий код?

{

    int x = 0;

    x++;

}

Console.WriteLine(--x);


```
```c#
//Каким будет результат вычисления выражения 7-3>3*5 == true?
```
```c#

```



> Задачи I

1. Создать класс с именем Address. В теле класса требуется создать поля: index, country, city, street, house, apartment.
Для каждого поля, создать свойство с двумя методами доступа. Создать экземпляр класса Address. В поля экземпляра
записать информацию о почтовом адресе. Выведите на экран значения полей, описывающих адрес.

2. Создать класс с именем Rectangle. В теле класса создать два поля, описывающие длины сторон  double side1, side2.
Создать пользовательский конструктор  Rectangle(double side1, double side2) , в теле которого поля  side1 и side2
инициализируются значениями аргументов. Создать два метода, вычисляющие площадь прямоугольника - double AreaCalculator()
и периметр прямоугольника - double PerimeterCalculator(). Создать два свойства  double Area и double Perimeter с одним
методом доступа get. Написать программу, которая принимает от пользователя длины двух сторон прямоугольника и выводит
на экран периметр и площадь.

3. Создать класс Book. Создать классы Title, Author и Content, каждый из которых должен содержать одно строковое поле и
метод  void Show(). Реализуйте возможность добавления в книгу названия книги, имени автора и содержания. Выведите на
экран разными цветами при помощи метода Show() название книги, имя автора и содержание.

4. Создать классы Point и Figure. Класс Point должен содержать два целочисленных поля и одно строковое поле. Создать три
свойства  с одним методом доступа get. Создать пользовательский конструктор, в теле которого проинициализируйте поля
значениями аргументов. Класс Figure должен содержать конструкторы, которые принимают от 3-х до 5-ти аргументов
типа Point. Создать два метода:  double LengthSide(Point A, Point B), который рассчитывает длину стороны многоугольника;
void PerimeterCalculator(), который рассчитывает периметр многоугольника. Написать программу, которая выводит на экран
название и периметр многоугольника.

5. Создать класс  Converter. В теле класса создать пользовательский конструктор, который принимает три вещественных
аргумента, и инициализирует поля соответствующие курсу 3-х основных валют, по отношению к гривне –
public Converter(double usd, double eur, double rub). Написать программу, которая будет выполнять конвертацию из гривны
в одну из указанных валют, также программа должна производить конвертацию из указанных валют в гривну.

6. Создать класс Employee. В теле класса создать пользовательский конструктор, который принимает два строковых аргумента,
и инициализирует поля, соответствующие фамилии и имени сотрудника. Создать метод рассчитывающий оклад сотрудника (в
зависимости от должности и стажа) и налоговый сбор. Написать программу, которая выводит на экран информацию о сотруднике
(фамилия, имя, должность), оклад и  налоговый сбор.

7. Создать класс Invoice. В теле класса создать три поля  int account, string customer, string provider, которые должны
быть проинициализированы один раз (при создании экземпляра данного класса) без возможности их дальнейшего изменения. В
теле класса создать два закрытых поля string article, int quantity. Создать метод расчета стоимости заказа с НДС и
без НДС. Написать программу, которая выводит на экран сумму оплаты заказанного товара с НДС или без НДС.

> Задачи II

1. Создайте класс Printer. В теле класса создайте метод void Print(string value), который выводит на экран значение
аргумента. Реализуйте возможность того, чтобы в случае наследования от данного класса других классов, и вызове
соответствующего метода их экземпляра, строки, переданные в качестве аргументов методов, выводились разными цветами.
Обязательно используйте приведение типов.

2. Создать класс, представляющий учебный класс ClassRoom. Создайте класс ученик Pupil. В теле класса создайте методы
void Study(), void Read(), void Write(), void Relax(). Создайте 3 производных класса ExcelentPupil, GoodPupil, BadPupil
от класса базового класса Pupil и переопределите каждый из методов, в зависимости от успеваемости ученика. Конструктор
класса ClassRoom принимает аргументы типа Pupil, класс должен состоять из 4 учеников. Предусмотрите возможность того,
что пользователь может передать 2 или 3 аргумента. Выведите информацию о том, как все ученики экземпляра класса
ClassRoom умеют учиться, читать, писать, отдыхать.

3. В теле класса создайте поля: координаты и параметры средств передвижения (цена, скорость, год выпуска). Создайте 3
производных класса Plane, Саг и Ship. Для класса Plane должна быть определена высота и количество пассажиров. Для класса
Ship — количество пассажиров и порт приписки. Написать программу, которая выводит на экран информацию о каждом
средстве передвижения.

4. Создайте класс DocumentWorker. В теле класса создайте три метода OpenDocument(), EditDocument(), SaveDocument().
В тело каждого из методов добавьте вывод на экран соответствующих строк:  "Документ открыт", "Редактирование документа
доступно в версии Про", "Сохранение документа доступно в версии Про". Создайте производный класс ProDocumentWorker.
Переопределите соответствующие методы, при переопределении методов выводите следующие строки: "Документ отредактирован",
"Документ сохранен в старом формате, сохранение в остальных форматах доступно в версии Эксперт". Создайте производный
класс ExpertDocumentWorker от базового класса ProDocumentWorker. Переопределите соответствующий метод. При вызове
данного метода необходимо выводить на экран "Документ сохранен в новом формате". В теле метода Main() реализуйте
возможность приема от пользователя номера ключа доступа pro и exp. Если пользователь не вводит ключ, он может
пользоваться только бесплатной версией (создается экземпляр базового класса), если пользователь ввел номера ключа
доступа pro и exp, то должен создаться экземпляр соответствующей версии класса, приведенный к базовому –  DocumentWorker.

> Задачи III

1. Создайте класс AbstractHandler. В теле класса создать методы void Open(), void Create(), void Chenge(), void Save().
Создать производные классы XMLHandler, TXTHandler, DOCHandler от базового класса AbstractHandler. Написать программу,
которая будет выполнять определение документа и для каждого формата должны быть методы открытия, создания,
редактирования, сохранения определенного формата документа.

2. Создайте 2 интерфейса IPlayable и IRecodable. В каждом из интерфейсов создайте по 3 метода void Play() / void Pause()
/ void Stop() и void Record() / void Pause() / void Stop() соответственно. Создайте производный класс Player от базовых
интерфейсов IPlayable и IRecodable. Написать программу, которая выполняет проигрывание и запись.

